## Pandas Basics

In [14]:
import pandas as pd

dfc = pd.read_csv('orders.csv')
# df

In [15]:
dfc.describe()

             sales   quantity       profit
count    50.000000  50.000000    50.000000
mean    300.792000   3.920000   -20.550000
std     547.564035   1.977836   251.767027
min       2.500000   2.000000 -1665.100000
25%      20.075000   2.000000     2.500000
50%      74.650000   3.000000     8.350000
75%     249.875000   5.000000    17.650000
max    3083.400000   9.000000   240.300000

In [16]:
dfc.head(5)

,order_id,order_date,ship_date,ship_mode,customer_id,region,product_id,category,sales,quantity,profit
0,CA-2020-152156,08-11-2020,11-11-2020,Second Class,CG-12520,South,FUR-BO-10001798,Furniture,262.0,2,41.9
1,CA-2020-152156,08-11-2020,11-11-2020,Second Class,CG-12520,South,FUR-CH-10000454,Furniture,731.9,3,219.6
2,CA-2020-138688,12-06-2020,16-06-2020,Second Class,DV-13045,West,OFF-LA-10000240,Office Supplies,14.6,2,6.9
3,US-2019-108966,11-10-2019,18-10-2019,Standard Class,SO-20335,South,FUR-TA-10000577,Furniture,957.6,5,-383.0
4,US-2019-108966,11-10-2019,18-10-2019,Standard Class,SO-20335,South,OFF-ST-10000760,Office Supplies,22.4,2,2.5

In [8]:
df.columns = ['order_date', 'order_id', 'ship_date', 'ship_mode', 'customer_id',
       'region', 'product_id', 'category', 'sales', 'quantity', 'profit']
# df

In [9]:
data = {'a':1, 'b':2, 'c':3}
pd.Series(data)

a    1
b    2
c    3
dtype: int64

In [26]:
## Dataframe
data = {
    'Name': ['Ansh','Srushti','Raj'],
    'Age':[21,23,21],
    'City':['Bangalore','Shimoga','Bangalore']
}
df = pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age       City
0     Ansh   21  Bangalore
1  Srushti   23    Shimoga
2      Raj   21  Bangalore
<class 'pandas.core.frame.DataFrame'>

In [21]:
df['Name']

0       Ansh
1    Srushti
2        Raj
Name: Name, dtype: object

In [24]:
## Accesing a specified element
df.at[1,'Age']

23

In [36]:
## Add a column
df['Salary'] = ['50000','50000','60000']
df

      Name  Age       City Salary
0     Ansh   21  Bangalore  50000
1  Srushti   23    Shimoga  50000
2      Raj   21  Bangalore  60000

In [37]:
## Remove a column
df.drop('Salary', axis=1, inplace=True)

In [38]:
df

      Name  Age       City
0     Ansh   21  Bangalore
1  Srushti   23    Shimoga
2      Raj   21  Bangalore

In [40]:
## Add age to the column
df['Age'] = df['Age']+1
df

      Name  Age       City
0     Ansh   22  Bangalore
1  Srushti   24    Shimoga
2      Raj   22  Bangalore

In [41]:
## Remove a row
df.drop(0)

      Name  Age       City
1  Srushti   24    Shimoga
2      Raj   22  Bangalore